# 9가지 알고리즘 분류 

# ⭐️ 1. 완전 탐색 ⭐️
# - 모든 경우의 수 들을 시도해보는 방법!
# - 시간복잡도가 역시 매우 높음 
# - 모든 문제에 적용이 가능하다 => 정 안 되면 완전탐색으로 일단 풀어....

# 👉 1) 단순 브루트포스 
# - 단순 반복문과 조건문을 사용하는 방법 
# - 무조건 다 반복문을 싹 다 돌려대니까 모든 경우의 수를 다 보니까 당연히 답을 찾을 수 있음 

# 👉 2) 비트마스크(bitmask)  

# 👉 3) 재귀함수 + 백트래킹 
# => 시간복잡도 O(N)

# 👉 4) 순열 조합 등등 
# O(N!) 

# 👉 5) BFS, DFS (그래프 탐색!!!!!!!!)



# ⭐️ 2. 그래프 탐색 ⭐️
# BFS DFS
# ❗️ 말 안 해도 중요함 ❗️
# 정점과 간선의 정의 
# 격자형 그래프, 일반 그래프, Tree등이 주로 나옴
# 국밥 유형 


# ⭐️ 3. DP ⭐️
# 말 안 해도 매우 어려움
# 매우매우 중요.... 

# ⭐️ 4. 이분 탐색 ⭐️

# ⭐️ 5. 그리디 ⭐️

# ⭐️ 6. 최단거리 ⭐️
# - 다익스트라 
# - 플로이드 워쉘 
# - 벨만포드 

# ⭐️ 7. 트리 ⭐️
# ⭐️ 8. 위상정렬 ⭐️





# 공부 방식 

# 1. 자료구조 
# - 배열 
# - 연결리스트 
# - 해시 테이블 
# - 스택 
# - 큐
# - 힙 
# - 트리 & 그래프 


# 2. 알고리즘 
# - 이진 탐색(이분 탐색)
# - 정렬 (sort)
# - 재귀 (Recursion)
# - BFS, DFS (그래프 탐색) 
# - 백트래킹(Backtracking)
# - DP (가장 어렵... )
