# 변수 => 값을 담는 상자 
# 일단 = 연산자 (왼쪽 변수의 값을 오른쪽 값으로 바꾼다 라는 의미 => 바꾼다..!  )

# ❗️자료형❗️

# 1. 숫자형(정수, 실수를 가장 많이 사용하고 밑에 3개는 거의 쓸 일 없음!)
# 🔴 정수 실수라고 생각하자 🔴  
# - 정수 
a = 10
print(type(a)) # <class 'int'>
# - 👉 숫자형 자료들을 이요한 사칙연산 
# 더하기 빼기 곱하기 몫 연산자  
print(3 + 4)
print( 3 * 4 )
print(10/4) # float가 나옴 2.5
print(10//4) # 몫 연산자. 2 => 몫이 나오는데, 소수점을 없애준다. 
print(1 % 3) # 뒤에 -1 값 까지만 나올 수 있다..! 3으로 나누는데, 3이 나머지가 될 순 없어 


# - 실수 
# - 컴퓨터식 지수표현 
# - 8진수
# - 16진수


# 2. 문자형 
str = "dw\'d\'wdwdw"
print(str)
print(type(str))


str2 = "hello\ndwdadawd\ndwd\tw\'d\d\n"